SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32ZG28/Include/efr32zg28_gpio.h
/* Bit fields for GPIO_LESENSE CH11OUTROUTE */
#define _GPIO_LESENSE_CH11OUTROUTE_RESETVALUE            0x00000000UL                                   /**< Default value for GPIO_LESENSE_CH11OUTROUTE */
#define _GPIO_LESENSE_CH11OUTROUTE_MASK                  0x000F0003UL                                   /**< Mask for GPIO_LESENSE_CH11OUTROUTE          */
#define _GPIO_LESENSE_CH11OUTROUTE_PORT_SHIFT            0                                              /**< Shift value for GPIO_PORT                   */
#define _GPIO_LESENSE_CH11OUTROUTE_PORT_MASK             0x3UL                                          /**< Bit mask for GPIO_PORT                      */
#define _GPIO_LESENSE_CH11OUTROUTE_PORT_DEFAULT          0x00000000UL                                   /**< Mode DEFAULT for GPIO_LESENSE_CH11OUTROUTE  */
#define GPIO_LESENSE_CH11OUTROUTE_PORT_DEFAULT           (_GPIO_LESENSE_CH11OUTROUTE_PORT_DEFAULT << 0) /**< Shifted mode DEFAULT for GPIO_LESENSE_CH11OUTROUTE*/
#define _GPIO_LESENSE_CH11OUTROUTE_PIN_SHIFT             16                                             /**< Shift value for GPIO_PIN                    */
#define _GPIO_LESENSE_CH11OUTROUTE_PIN_MASK              0xF0000UL                                      /**< Bit mask for GPIO_PIN                       */
#define _GPIO_LESENSE_CH11OUTROUTE_PIN_DEFAULT           0x00000000UL                                   /**< Mode DEFAULT for GPIO_LESENSE_CH11OUTROUTE  */
#define GPIO_LESENSE_CH11OUTROUTE_PIN_DEFAULT            (_GPIO_LESENSE_CH11OUTROUTE_PIN_DEFAULT << 16) /**< Shifted mode DEFAULT for GPIO_LESENSE_CH11OUTROUTE*/

/* Bit fields for GPIO_LESENSE CH12OUTROUTE */
#define _GPIO_LESENSE_CH12OUTROUTE_RESETVALUE            0x00000000UL                                   /**< Default value for GPIO_LESENSE_CH12OUTROUTE */
#define _GPIO_LESENSE_CH12OUTROUTE_MASK                  0x000F0003UL                                   /**< Mask for GPIO_LESENSE_CH12OUTROUTE          */
#define _GPIO_LESENSE_CH12OUTROUTE_PORT_SHIFT            0                                              /**< Shift value for GPIO_PORT                   */
#define _GPIO_LESENSE_CH12OUTROUTE_PORT_MASK             0x3UL                                          /**< Bit mask for GPIO_PORT                      */
#define _GPIO_LESENSE_CH12OUTROUTE_PORT_DEFAULT          0x00000000UL                                   /**< Mode DEFAULT for GPIO_LESENSE_CH12OUTROUTE  */
#define GPIO_LESENSE_CH12OUTROUTE_PORT_DEFAULT           (_GPIO_LESENSE_CH12OUTROUTE_PORT_DEFAULT << 0) /**< Shifted mode DEFAULT for GPIO_LESENSE_CH12OUTROUTE*/
#define _GPIO_LESENSE_CH12OUTROUTE_PIN_SHIFT             16                                             /**< Shift value for GPIO_PIN                    */
#define _GPIO_LESENSE_CH12OUTROUTE_PIN_MASK              0xF0000UL                                      /**< Bit mask for GPIO_PIN                       */
#define _GPIO_LESENSE_CH12OUTROUTE_PIN_DEFAULT           0x00000000UL                                   /**< Mode DEFAULT for GPIO_LESENSE_CH12OUTROUTE  */
#define GPIO_LESENSE_CH12OUTROUTE_PIN_DEFAULT            (_GPIO_LESENSE_CH12OUTROUTE_PIN_DEFAULT << 16) /**< Shifted mode DEFAULT for GPIO_LESENSE_CH12OUTROUTE*/

/* Bit fields for GPIO_LESENSE CH13OUTROUTE */
#define _GPIO_LESENSE_CH13OUTROUTE_RESETVALUE            0x00000000UL                                   /**< Default value for GPIO_LESENSE_CH13OUTROUTE */
#define _GPIO_LESENSE_CH13OUTROUTE_MASK                  0x000F0003UL                                   /**< Mask for GPIO_LESENSE_CH13OUTROUTE          */
#define _GPIO_LESENSE_CH13OUTROUTE_PORT_SHIFT            0                                              /**< Shift value for GPIO_PORT                   */
#define _GPIO_LESENSE_CH13OUTROUTE_PORT_MASK             0x3UL                                          /**< Bit mask for GPIO_PORT                      */
#define _GPIO_LESENSE_CH13OUTROUTE_PORT_DEFAULT          0x00000000UL                                   /**< Mode DEFAULT for GPIO_LESENSE_CH13OUTROUTE  */
#define GPIO_LESENSE_CH13OUTROUTE_PORT_DEFAULT           (_GPIO_LESENSE_CH13OUTROUTE_PORT_DEFAULT << 0) /**< Shifted mode DEFAULT for GPIO_LESENSE_CH13OUTROUTE*/
#define _GPIO_LESENSE_CH13OUTROUTE_PIN_SHIFT             16                                             /**< Shift value for GPIO_PIN                    */
#define _GPIO_LESENSE_CH13OUTROUTE_PIN_MASK              0xF0000UL                                      /**< Bit mask for GPIO_PIN                       */
#define _GPIO_LESENSE_CH13OUTROUTE_PIN_DEFAULT           0x00000000UL                                   /**< Mode DEFAULT for GPIO_LESENSE_CH13OUTROUTE  */
#define GPIO_LESENSE_CH13OUTROUTE_PIN_DEFAULT            (_GPIO_LESENSE_CH13OUTROUTE_PIN_DEFAULT << 16) /**< Shifted mode DEFAULT for GPIO_LESENSE_CH13OUTROUTE*/

/* Bit fields for GPIO_LESENSE CH14OUTROUTE */
#define _GPIO_LESENSE_CH14OUTROUTE_RESETVALUE            0x00000000UL                                   /**< Default value for GPIO_LESENSE_CH14OUTROUTE */
#define _GPIO_LESENSE_CH14OUTROUTE_MASK                  0x000F0003UL                                   /**< Mask for GPIO_LESENSE_CH14OUTROUTE          */
#define _GPIO_LESENSE_CH14OUTROUTE_PORT_SHIFT            0                                              /**< Shift value for GPIO_PORT                   */
#define _GPIO_LESENSE_CH14OUTROUTE_PORT_MASK             0x3UL                                          /**< Bit mask for GPIO_PORT                      */
#define _GPIO_LESENSE_CH14OUTROUTE_PORT_DEFAULT          0x00000000UL                                   /**< Mode DEFAULT for GPIO_LESENSE_CH14OUTROUTE  */
#define GPIO_LESENSE_CH14OUTROUTE_PORT_DEFAULT           (_GPIO_LESENSE_CH14OUTROUTE_PORT_DEFAULT << 0) /**< Shifted mode DEFAULT for GPIO_LESENSE_CH14OUTROUTE*/
#define _GPIO_LESENSE_CH14OUTROUTE_PIN_SHIFT             16                                             /**< Shift value for GPIO_PIN                    */
#define _GPIO_LESENSE_CH14OUTROUTE_PIN_MASK              0xF0000UL                                      /**< Bit mask for GPIO_PIN                       */
#define _GPIO_LESENSE_CH14OUTROUTE_PIN_DEFAULT           0x00000000UL                                   /**< Mode DEFAULT for GPIO_LESENSE_CH14OUTROUTE  */
#define GPIO_LESENSE_CH14OUTROUTE_PIN_DEFAULT            (_GPIO_LESENSE_CH14OUTROUTE_PIN_DEFAULT << 16) /**< Shifted mode DEFAULT for GPIO_LESENSE_CH14OUTROUTE*/

/* Bit fields for GPIO_LESENSE CH15OUTROUTE */
#define _GPIO_LESENSE_CH15OUTROUTE_RESETVALUE            0x00000000UL                                   /**< Default value for GPIO_LESENSE_CH15OUTROUTE */
#define _GPIO_LESENSE_CH15OUTROUTE_MASK                  0x000F0003UL                                   /**< Mask for GPIO_LESENSE_CH15OUTROUTE          */
#define _GPIO_LESENSE_CH15OUTROUTE_PORT_SHIFT            0                                              /**< Shift value for GPIO_PORT                   */
#define _GPIO_LESENSE_CH15OUTROUTE_PORT_MASK             0x3UL                                          /**< Bit mask for GPIO_PORT                      */
#define _GPIO_LESENSE_CH15OUTROUTE_PORT_DEFAULT          0x00000000UL                                   /**< Mode DEFAULT for GPIO_LESENSE_CH15OUTROUTE  */
#define GPIO_LESENSE_CH15OUTROUTE_PORT_DEFAULT           (_GPIO_LESENSE_CH15OUTROUTE_PORT_DEFAULT << 0) /**< Shifted mode DEFAULT for GPIO_LESENSE_CH15OUTROUTE*/
#define _GPIO_LESENSE_CH15OUTROUTE_PIN_SHIFT             16                                             /**< Shift value for GPIO_PIN                    */
#define _GPIO_LESENSE_CH15OUTROUTE_PIN_MASK              0xF0000UL                                      /**< Bit mask for GPIO_PIN                       */
#define _GPIO_LESENSE_CH15OUTROUTE_PIN_DEFAULT           0x00000000UL                                   /**< Mode DEFAULT for GPIO_LESENSE_CH15OUTROUTE  */
#define GPIO_LESENSE_CH15OUTROUTE_PIN_DEFAULT            (_GPIO_LESENSE_CH15OUTROUTE_PIN_DEFAULT << 16) /**< Shifted mode DEFAULT for GPIO_LESENSE_CH15OUTROUTE*/

